In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'shubh'],
    "marks":[92,88,35,99],
    "city":['rampur', 'kolkata', 'bareilly', 'delhi']
}

In [3]:
df = pd.DataFrame(dict1)

Dataframe is like a excel sheet

In [4]:
df

     name  marks      city
0   harry     92    rampur
1   rohan     88   kolkata
2  skillf     35  bareilly
3   shubh     99     delhi

In [5]:
df.to_csv('pandastutorial.csv')

Converted to excel

In [6]:
df.to_csv('pandastutorial.csv', index=False)

No index numbers will be there

In [7]:
df

     name  marks      city
0   harry     92    rampur
1   rohan     88   kolkata
2  skillf     35  bareilly
3   shubh     99     delhi

In [8]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     88  kolkata

Two rows from start

In [9]:
df.describe()

           marks
count   4.000000
mean   78.500000
std    29.354159
min    35.000000
25%    74.750000
50%    90.000000
75%    93.750000
max    99.000000

It will tell about average, mean, standard deviation, etc

In [12]:
shubh = pd.read_csv('shubh.csv')

In [13]:
shubh

   Train no       City       Dest
0     12222      Delhi     Mumbai
1     22222     Mumbai      Delhi
2     33333    Chennai  Bangalore
3     44444  Bangalore    Chennai

In [16]:
shubh['City'][0] = ('Gujrat')

C:\Users\shubh\AppData\Local\Temp\ipykernel_8660\3486458216.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  shubh['City'][0] = ('Gujrat')

In [17]:
shubh

   Train no       City       Dest
0     12222     Gujrat     Mumbai
1     22222     Mumbai      Delhi
2     33333    Chennai  Bangalore
3     44444  Bangalore    Chennai

In [18]:
shubh.to_csv('shubh1.csv')

In [20]:
shubh.index = ['hey', 'hello', 'hi', 'hoo']

In [21]:
shubh

       Train no       City       Dest
hey       12222     Gujrat     Mumbai
hello     22222     Mumbai      Delhi
hi        33333    Chennai  Bangalore
hoo       44444  Bangalore    Chennai